---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Field.SubEntityWriteAccessGranted
source: html/b640b997-3fd9-e919-40e9-1a3604b68b98.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.SubEntityWriteAccessGranted Method

Checks whether there is write access to subentities storable in this field.

## Syntax (C#)
```csharp
public bool SubEntityWriteAccessGranted()
```

## Returns
True if subentities are writable.